{
  "acldvppSetPicDescWidth": "For yuv420sp format, both width and height need 2 alignment, and for yuv422sp or yuv422packed format,the width needs 2 alignment",
  "acldvppSetPicDescHeight": "For yuv420sp format, both width and height need 2 alignment, and for yuv440sp format, the height needs 2 alignment",
  "acldvppSetResizeConfigInterpolation": "Ascend 310P 0:(default) Bilinear algorithm.1：Bilinear algorithm  2：Nearest neighbor algorithm",
  "acldvppSetPicDescSize": "Ascend 310P:Support yuv400 format image processing, directly set the format of the input image to yuv400,and the memory size to widthstripe*heightslide. VPC will verify the memory size according to the image format",
  "aclvdecSetChannelDescOutPicWidth": "Input code stream buffer size: maximum width of decoded code stream * maximum height of decoded code stream *2,Ascend 310P:calculate the cache size of the input code stream using the formula, needs to modify the code and call the aclvdecsetchanneldescoutpicwidth and aclvdecsetchanneldescoutpicheight interfaces to set the correct width and height.",
  "aclvdecSetChannelDescOutPicHeight": "Input code stream buffer size: maximum width of decoded code stream * maximum height of decoded code stream *2,Ascend 310P:calculate the cache size of the input code stream using the formula, needs to modify the code and call the aclvdecsetchanneldescoutpicwidth and aclvdecsetchanneldescoutpicheight interfaces to set the correct width and height.",
  "aclvdecSetChannelDescRefFrameNum": "The default value of reference frame is 8, which is compatible with decoding most code streams, but for code streams with a large number of reference frames, decoding may fail.",
  "aclvdecSetChannelDescBitDepth": "For a 10bit code stream, if it is not set, decoding may fail. You need to call the aclvdecsetchanneldescbitdepth interface to set the bit width to 10bit",
  "aclvencSetChannelDescParam": "Ascend 310P:cannot use the set IP ratio function,needs to set the output buffer, and there is no need to copy the encoded output results again. Set the output code rate to 300, otherwise the default value of 2000 will be used on ascend 310P.",
  "aclvencSetChannelDescBufAddr": "The user needs to set the output buffer, and there is no need to copy the encoded output results again.",
  "aclvencSetChannelDescMaxBitRate": "If the user does not explicitly call the aclvencsetchanneldescmaxbitrate interface or aclvencsetchanneldescparam interface, the encoder will use the default output code rate for encoding. After migrating to ascend 310P, you need to explicitly call the aclvencsetchanneldescmaxbitrate interface or aclvencsetchanneldescparam interface to set the output code rate to 300, otherwise the default value of 2000 will be used on ascend 310P.",
  "acldvppSetChannelDescMode": "It supports setting the channel mode. If the channel mode is not set, the channel of vpc+jpegd+jpege+pngd will be created by default when creating the channel, which may occupy resources.",
  "acldvppCreateChannel": "310P: vdec and jpegd share the channel number and support 256 channels at most. VPC supports 256 channels at most. Jpege and Venc share the same channel and the maximum number of channels is 128.",
  "aclvdecCreateChanne": "310P: vdec and jpegd share the channel number and support 256 channels at most. VPC supports 256 channels at most. Jpege and Venc share the same channel and the maximum number of channels is 128.",
  "aclvencCreateChannel": "310P: vdec and jpegd share the channel number and support 256 channels at most. VPC supports 256 channels at most. Jpege and Venc share the same channel and the maximum number of channels is 128."
}
